/*该函数用来输出摩擦力矩*/
#include "SR4_tau_f.h"
// 该函数用于计算每一个齐次变换矩阵,输入MDH参数，返回T
std::vector<double>  Com_tau_f(const int n,Eigen::Matrix<double,6,1> dq)
{
    // 关节非线性摩擦参数
    const double Fc[n] = {39.3156017014124,
                          5.74376743911912,
                          11.0817930270772,
                          1.30308256888117,
                          1.33226719773913,
                          1.57685226136080};

    const double Fs[n] = {-2.53722774557035,
                          -2.07595046391569,
                          0.155945016604755,
                          -0.432048786756766,
                          -0.299954735443126,
                          -1.12558099217137};

    const double vs[n] = {6159.98349836929,
                          -0.00542827529961853,
                          -4.99999961405425,
                          0.000166612161014179,
                          0.000335859662883711,
                          0.00125116525892426};

    const double Fv[n] = {5.67202325533792,
                          9.50541644780893,
                          3.62367344786894,
                          2.01161766835989,
                          1.77753031609100,
                          1.84035495310709};

    const double delta_s[n] = {0.145914867459757,
                               0.272713039894872,
                               0.335189700243761,
                               1.99565622087150,
                               1.99730531138284,
                               0.323686309612415};

    // 计算摩擦参数,需要输入dq，输出六个关节的摩擦力矩
    std::vector<double> g_q(n+1, 0.0);
    std::vector<double> vis_q(n+1, 0.0);
    std::vector<double> tau_f(n+1, 0.0);
    for (int i=0;i<n;i++)
    {
        g_q[i] =  (Fc[i]+(Fs[i]-Fc[i])*std::exp(-pow(abs(dq[i]/vs[i]),delta_s[i])))*tanh(dq[i]);
        vis_q[i] = Fv[i]*dq[i];
        tau_f[i] = g_q[i]+vis_q[i];
    }
    return tau_f;
}
