#ifndef SR4_RNEA_FPGA
#define SR4_RNEA_FPGA

/*该代码用于在FPGA进行综合*/
// #include <ap_fixed.h>      // 定点数
// #include <ap_int.h>        // 整数优化
#include <array>

typedef double data_t;

// 定义常量
const int n = 6;

static const data_t Z[3] = {0.0, 0.0, 1.0};

// 输入各个连杆质量，用于计算力
static const data_t m[n] = {3.16699999486378,
                            3.89505775503759,
                            1.55161965449885,
                            1.88199999547530,
                            1.34621855234916,
                            0.633999997351584};

// 输入各个连杆质心坐标向量，用于计算质心线加速度
static const data_t P_c[n][3] = {
                    {3.48369999434000e-05/m[0],
                    -0.0253106639589312/m[0],
                    -0.291864385526951/m[0]},

                    {0.659449401868420/m[1],
                    -0.0651938216320210/m[1],
                    -0.271940703633802/m[1]},

                    {-0.00157764514450908/m[2],
                    0.153969960151856/m[2],   
                    -0.00930606042947241/m[2]},

                    {-4.70521423066045e-05/m[3],
                    -0.0205570880251570/m[3],
                    -0.134124493621368/m[3]},

                    {-0.00190221636650860/m[4],
                    0.0159457855937173/m[4],
                    -0.0281550840659444/m[4]},
                    
                    {4.62815646042645e-05/m[5],
                    5.00861139672133e-05/m[5],
                    -0.0284368017495592/m[5]}
};

// 输入各个连杆的惯性张量矩阵，用于计算力矩
static const data_t I[n][9] = {
    {
        0.058267910813839,      -3.715826953316560e-07, -1.05949175179955e-06,
        -3.715826953316560e-07, 0.0576103483714700,     -0.00456914016524626,
        -1.05949175179955e-06,  -0.00456914016524626,   0.00607968319952077
    },

    {
        0.0380304151034530,   0.0419599871875192,  0.0436322529474843,
        0.0419599871875192,   0.263486545009477,   -0.00383736352324302,
        0.0436322529474843,  -0.00383736352324302,  0.250878539307793
    },

    {
        0.0359185029001311,   0.00357521327138579,  0.000314442104644629,
        0.00357521327138579,  0.00328728806178666,  0.00270560721315391,
        0.000314442104644629, 0.00270560721315391,  0.0354951529635439
    },

    {
        0.0231030453535813,     -2.36395069266735e-06,  -2.48326590911455e-06,
        -2.36395069266735e-06,  0.0220785414360184,     -0.00290398198945597,
        -2.48326590911455e-06,  -0.00290398198945597,   0.00301282626685543
    },

    {
        0.00568553742802938,    1.20535594054042e-05, -4.97420578495685e-05,
        1.20535594054042e-05,   0.00444010179654207,   0.000717862262034322,
        -4.97420578495685e-05,  0.000717862262034322,  0.00277209865650963
    },

    {
        0.00227249981806468,    -1.38365624835237e-06,  2.97586698701961e-06,
        -1.38365624835237e-06,  0.00227800923976532,    3.82651246364623e-06,
        2.97586698701961e-06,   3.82651246364623e-06,   0.000447957334568561
    }
};

// 在此编辑DH表，MDH
// MDH 参数
static const data_t sin_alpha[n] = {
     0.0f,
    -1.0f,
     0.0f,
    -1.0f,
     1.0f,
    -1.0f
};

static const data_t cos_alpha[n] = {
     1.0f,
     0.0f,
    -1.0f,
     0.0f,
     0.0f,
     0.0f
};

static const data_t a[n] = {
    0.0,
    0.0,
    0.403112,
    -0.05,
    0.0,
    0.0
};

static const data_t d[n] = {
    0.328,
    0.0,
    0.4,
    0.4,
    -0.136,
    0.1035
};

//===============摩擦参数===============
// 关节非线性摩擦参数
static const data_t Fc[n] = {39.3156017014124,
                            5.74376743911912,
                            11.0817930270772,
                            1.30308256888117,
                            1.33226719773913,
                            1.57685226136080};

static const data_t Fs[n] = {-2.53722774557035,
                            -2.07595046391569,
                            0.155945016604755,
                            -0.432048786756766,
                            -0.299954735443126,
                            -1.12558099217137};

static const data_t vs[n] = {6159.98349836929,
                            -0.00542827529961853,
                            -4.99999961405425,
                            0.000166612161014179,
                            0.000335859662883711,
                            0.00125116525892426};

static const data_t Fv[n] = {5.67202325533792,
                            9.50541644780893,
                            3.62367344786894,
                            2.01161766835989,
                            1.77753031609100,
                            1.84035495310709};

static const data_t delta_s[n] = {0.145914867459757,
                                0.272713039894872,
                                0.335189700243761,
                                1.99565622087150,
                                1.99730531138284,
                                0.323686309612415};

//======================== 齐次变换矩阵 ========================
// 矩阵变换，DH矩阵、旋转矩阵等生成
// 该函数用于计算每一个齐次变换矩阵,输入MDH参数，返回T
// 一维数组展开，传输、计算效率高，data_t T[6][16]
// HLS下稳妥的写法是输入数组加输出数组
void Com_MDH_Trans( 
    const data_t  a[n],
    const data_t  d[n],
    const data_t  q[n],
    const data_t  sinq[n],
    const data_t  sin_alpha[n],
    const data_t  cosq[n],
    const data_t  cos_alpha[n],
    data_t T[n][16]
);

//该函数用于在齐次变换矩阵中返回旋转矩阵，输入T，返回Rot
void Ext_Rot(const data_t T[n][16],data_t R[n][9]);

//该函数用于在齐次变换矩阵中返回旋转矩阵的转置，输入T，返回Rot_trans
void Ext_Rot_trans(const data_t T[n][16],data_t R_Tran[n][9]);

//该函数用于返回位置矩阵P
void Ext_Pos(const data_t T[n][16],data_t P[n][3]);
// ====================== 静态数组的矩阵运算 ========================
// 静态数组的矩阵乘法运算(9元素旋转矩阵*3元素向量)
void mat_9x3_vec(
    const data_t A[9],
    const data_t x[3],
    data_t y[3]
);

//======================== RNEA主要力矩计算 ========================
// 主要计算循环,RNEA外推计算
void SR4_rnea_hls(
    const data_t q[n],
    const data_t dq[n],
    const data_t ddq[n],
    const data_t sinq[n],
    const data_t cosq[n],
    data_t omega[n+1][3],
    data_t d_omega[n+1][3],
    data_t d_v[n+1][3],
    data_t d_v_c[n+1][3],
    data_t F[n+1][3],
    data_t N[n+1][3],
    data_t f[n+1][3],
    data_t n_f[n+1][3],
    data_t tau[n+1]
);


// //======================== RNEA摩擦力计算 ========================
// std::vector<double>  Com_tau_f(const int n,Eigen::Matrix<double,6,1> dq)
// {
//     // 计算摩擦参数,需要输入dq，输出六个关节的摩擦力矩
//     std::vector<double> g_q(n+1, 0.0);
//     std::vector<double> vis_q(n+1, 0.0);
//     std::vector<double> tau_f(n+1, 0.0);
//     for (int i=0;i<n;i++)
//     {
//         g_q[i] =  (Fc[i]+(Fs[i]-Fc[i])*std::exp(-pow(abs(dq[i]/vs[i]),delta_s[i])))*tanh(dq[i]);
//         vis_q[i] = Fv[i]*dq[i];
//         tau_f[i] = g_q[i]+vis_q[i];
//     }
//     return tau_f;
// }


#endif